Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.IsDirectContext3DHandleLoaded(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether the provided Element ID corresponds to a DirectContext3D handle element and is correctly loaded.
Remarks:
DirectContext3D handle instances are DirectShapes.
view:
The view.
aDocument:
The document.
elementId:
The ID of the element to check.
Returns:
True, if the DirectContext3D handle is loaded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.UpdateHandleTypeSourceId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Updates a DirectContext3D handle type element based on the information reported by the corresponding DirectContext3D server.
aDocument:
The document.
handleTypeId:
The ID of the handle type element.
sourceId:
The navisworks file path
Throws Autodesk.Revit.Exceptions.ArgumentException:
the Element ID handleTypeId does not correspond to a valid DirectContext3D handle type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.RegenerateHandleType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Updates a DirectContext3D handle type element based on the information reported by the corresponding DirectContext3D server.
aDocument:
The document.
handleTypeId:
The ID of the handle type element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the Element ID handleTypeId does not correspond to a valid DirectContext3D handle type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.DirectContext3D.DirectContext3DDocumentUtils.CreateDirectContext3DHandleType(Autodesk.Revit.DB.Document,System.String,System.String,Autodesk.Revit.DB.ElementId)
Creates a DirectContext3D handle type element based on the information provided by the specified DirectContext3D server.
aDocument:
The document.
sourceId:
The source of directContext data.
applicationId:
The ID of the application that will supply the server
handleCategory:
The DirectContext3D handle category to assign to the new handle.
Returns:
The created handle type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the category ID handleCategory is not valid for DirectContext3D handles.
-or-
aDocument is not a project document.
-or-
aDocument is not a primary document, it is a linked document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if handle type geometry could not be created based on the bounding box provided by the DirectContext3D server.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018